{
    "welcome": "Whoops Privacy Input_",
    "logo": "Logo",
    "home": "Home",
    "not_found": "404 - Page Not Found",
    "sub_title": "Start Your Encrypted Messaging",
    "security": "Privacy Protection",
    "ids": "Multiple Platform Integration",
    "password": "Offline Account",
    "footerText": "2020 Whoops, All Rights Reserved. Read ",
    "userAgreement": "Terms of Use",
    "and": " and ",
    "privacy": "Privacy Policy",
    "stop": ".",
    "uaTitle": "Whoops Service Protocol",
    "ua1": "You are welcome to use Whoops service!",
    "ua2": "To use Whoops Services, you should read and comply with the Whoops Service Agreement (this Agreement) and the Whoops Privacy Policy. It is important that you carefully read and fully understand the terms and conditions, especially those that exclude or limit Whoops liability, limit user rights, prescribe dispute resolution and jurisdiction (as in Article 18), and separate agreements or rules for opening or using a service. Restrictions, exclusions, or other provisions involving your material interests may be in the form of bold, underlined, etc. to prompt your attention.",
    "ua3": "       You are not entitled to use Whoops Services unless you have fully read, fully understand and accept all terms of this Agreement. By clicking 'Agree' or 'Next', or by using Whoops Services, or by any other express or implied acceptance of this Agreement, you are deemed to have read and agreed to sign this Agreement. This Agreement shall become a binding legal document between you and Whoops.",
    "ua4": "       If you do not have full capacity for civil conduct due to age, intelligence and other factors, please read and judge whether you agree to this Agreement with the legal guardian (hereinafter referred to as the 'Guardian'), and pay special attention to the terms of use for minors.",
    "ua5": "       If you are a user outside the Mainland of China, you are required to enter into or perform this Agreement in accordance with the laws of your country and/or territory. ",
    "ua6": "I. [Scope of Agreement]",
    "ua7": "      1.1 This Agreement is an agreement between User and Whoops regarding the services that user USES Whoops. 'Whoops' means the operational associated units that may exist for Whoops and/or its associated services. 'User' means the person who USES the service under Whoops and is referred to more generally as 'you' in this Agreement.",
    "ua8": "      1.2 Whoops' Services mean the products and services provided by Whoops to users, including but not limited to instant messaging, web media, Internet value-added, interactive entertainment, financial payments, advertising, etc., as actually provided by Whoops (the 'Services').",
    "ua9": "      1.3 This Agreement also includes the Whoops Privacy Policy, and when you use a specific Whoops service, the Service may have a separate agreement, relevant business rules, etc. (collectively, the 'Separate Agreement'). Once published, the foregoing shall form an integral part of this Agreement and you shall also abide by it. Your acceptance of any of the foregoing separate agreements shall constitute your acceptance of this Agreement in its entirety. Your acceptance of this Agreement shall be deemed to be your acceptance of Whoops Privacy Policy.",
    "ua10": "Ii. [Account and Password Security]",
    "ua11": "      2.1 You may need to register an account when using the Service. Please carefully read and abide by the relevant separate protocols for the specific rules of your account usage.",
    "ua12": "      2.2 Whoops specifically reminds you to keep your account and password safe. When you have finished using it, you should exit safely. Your improper care may result in the theft of a stolen number or password at your sole responsibility.",
    "ua13": "      2.3 For the purpose of enhancing user experience and/or technical convenience, accounts of the Service may include Numbers, letters or combinations thereof, as well as mobile phone Numbers, E-mail addresses and other forms. When you sign up for an account, Whoops may give you another representation of that account. The specific account form, account system and the relationship between accounts, etc. are subject to what Whoops actually provides.",
    "ua14": "      2.4 During the use of the Service, you may set up the nickname, avatar, signature, message and other information for the account you use, or set up or manage the name, image, profile and other information for you, Whoops group, etc. You should ensure that the information of content and form in accordance with the laws and regulations (' laws and regulations 'in this agreement refers to the user belongs to/region and country the current effective laws, administrative regulations and judicial interpretations, local regulations, local regulations, departmental rules and other regulatory documents as well as to such laws and regulations from time to time to modify and supplement, as well as the related policy, the same below.) , public order and custom, social ethics, and Whoops platform rules, without infringing the legitimate rights and interests of any subject.",
    "ua15": "      2.5 Some third-party websites or services may have a Whoops account as one of their login methods. You understand that these sites or services are not operated by Whoops unless otherwise specified by Whoops, and that you are at your own risk and responsibility for the security and availability of such third-party sites or services at your own discretion.",
    "ua16": "Iii. [User Personal Information Protection]",
    "ua17": "      3.1 Protecting users' personal information is a fundamental principle of Whoops. Whoops will collect, use, store, and share your personal information in accordance with this Agreement and the Whoops Privacy Policy. Where there are no specific provisions in this Agreement regarding the protection of personal Information, the contents of Whoops Privacy Policy shall prevail.",
    "ua18": "      3.2 You may need to fill in some necessary information when you register an account or use the Service. If the national laws and regulations have special provisions, you need to fill in the real identity information. If the information you fill in is incomplete, you may not be able to use the Service or may be restricted in the course of using it.",
    "ua19": "      3.3 In general, you may browse and modify the information submitted by yourself according to the relevant product rules, but for security and identification (such as number appeal service), you may not be able to modify the initial registration information and other authentication information provided during registration.",
    "ua20": "      3.4 Whoops will protect your personal information from unauthorized access, use, or disclosure using a variety of security technologies and procedures to the extent possible.",
    "ua21": "      3.5 Whoops will not transfer or disclose your personal information to any third party unless:",
    "ua22": "      (1) Relevant laws and regulations or requirements of judicial and administrative authorities.",
    "ua23": "      (2) Transfer for completion of merger, division, acquisition or asset transfer.",
    "ua24": "      (3) Necessary to provide the service you requested.",
    "ua25": "      (4) Circumstances that may be transferred or disclosed to any third party pursuant to the Whoops Privacy Policy or other relevant rules of agreement.",
    "ua26": "      3.6 Whoops attaches great importance to the protection of minors' personal information. If you do not have full capacity for civil conduct, you should obtain the consent of your guardian before using Whoops services.",
    "ua27": "Iv. [Method of Using the Service]",
    "ua28": "     4.1 The Service is for your personal, non-commercial use only, unless otherwise agreed with Whoops.",
    "ua29": "     4.2 Rights acquired by you under the terms of this Agreement are non-transferable.",
    "ua30": "     4.3 You shall not use any means (including but not limited to third-party software, plug-ins, plug-ins, systems, devices, etc.) to interfere with, destroy, modify or otherwise influence the Service.",
    "ua31": "     4.4 You shall use the Service in a manner provided or approved by Whoops and shall not log in or use the Service through any third-party software, plug-ins, plug-ins, systems, devices, etc.",
    "ua32": "     4.5 Without Whoops authorization, no person shall use any third-party software, plug-in, plug-in, or system to view or obtain Whoops, Whoops partners or users' relevant information, data, or other contents contained in the Service. Meanwhile, it shall strictly abide by the Robots protocol and other relevant protocol rules published by Whoops.",
    "ua33": "V. [Providing Services according to the Current Situation]",
    "ua34": "You understand and agree that:",
    "ua35": "     5.1 The Service is provided in accordance with the status quo that can be achieved by existing technology and conditions. Whoops will try our best to guarantee service continuity and security, but the Whoops can't foresee and prevent law, technology and other risks, Whoops of such risks in the legal liability to the extent permitted, including but not limited to force majeure, viruses, trojans, hacker attacks, system instability, third party service defects, government behavior and other reasons may lead to service interruptions, data loss and other loss and risk.",
    "ua36": "     5.2 The content of specific Whoops service available to users in different regions may differ due to business strategy arrangement or adjustment, and the specific content is subject to what Whoops actually provides.",
    "ua37": "Vi. [Self-Provided Equipment]",
    "ua38": "     6.1 You shall understand that you shall prepare terminal equipment (such as computers, mobile terminals and necessary network access devices) related to the relevant services by yourself and bear the necessary expenses (such as telephone charges, Internet access fees and other expenses).",
    "ua39": "     6.2 You understand and agree that your use of the Service will consume your terminal equipment, bandwidth and other resources.",
    "ua40": "Vii. [Advertisement]",
    "ua41": "     7.1 You agree that Whoops may send, display advertisements or other information (including commercial and non-commercial information) to you either by itself or by a third party via SMS, email or electronic message, and the specific form, frequency and content of the advertising or other information shall be subject to the actual provision by Whoops.",
    "ua42": "     7.2Whoops will carry out advertising business in accordance with relevant laws and regulations. You agree that you shall prudently judge the authenticity and reliability of advertisements appearing in the Services, and you shall be responsible for any ACTS performed in connection with such advertisements, except as expressly provided by law.",
    "ua43": "Viii. [Service Fee]",
    "ua44": "     8.1 Some of Whoops' services are provided on a fee-for-service basis. If you use the fee-for-service, please comply with the relevant agreement.",
    "ua45": "     8.2 Whoops may modify and change the charging standard and mode of the charging services based on actual needs. Whoops may also start charging for some of the free services. Whoops will notify or announce the foregoing changes, changes, or charges on the corresponding service page before they are made. If you do not agree with the above modifications, changes or paid content, you should stop using the service.",
    "ua46": "     8.3 Whoops reserves the right not to refund or adjust fees to original paying customers if Whoops reduces the charging rate or changes the charging rate to a free service.",
    "ua47": "Ix. [Products or services provided by third parties]",
    "ua48": "     When you use products or services provided by third parties on Whoops Platform, you shall comply with the user agreement of third parties in addition to the provisions of this Agreement. Whoops and third parties are individually liable for any disputes that may arise to the extent prescribed and agreed upon by law.",
    "ua49": "X. [Software Based Services]",
    "ua50": "If Whoops relies on the Software to provide services to you, you should also observe the following conventions:",
    "ua51": "     10.1 You may be required to download software during the use of the Service, and Whoops gives you a personal, non-transferable and non-exclusive license for such software. You may use the software only for the purpose of using the Service.",
    "ua52": "     10.2 Whoops may update the software for the purpose of improving the user experience, ensuring the security of the service and the consistency of product functions. You should update the software to the latest version, otherwise Whoops does not guarantee that the software or service will work properly.",
    "ua53": "     10.3 Whoops may develop different software versions for different terminal devices, and you should download the appropriate version to install according to the actual situation. You can get the software directly from the Whoops platform, or from a third party who is authorized by Whoops. Whoops does not guarantee that the software or service will work properly if you obtain the software or installation program with the same name from a third party who has not been authorized by Whoops, and is not responsible for any damages caused to you.",
    "ua54": "     10.4 Unless Whoops permits you in writing, you may not do any of the following:",
    "ua55": "     (1) Delete copyright information on the software and its copies.",
    "ua56": "     (2) Reverse engineer, reverse assemble, reverse compile, or otherwise attempt to discover the source code of the software.",
    "ua57": "     (3) Use, rent, lend, copy, modify, link, reprint, compile, publish, publish and mirror the content which Whoops owns the intellectual property rights.",
    "ua58": "     (4) in the process of software or software operation to release to any terminal data in memory, in the process of the software to run the client and server interaction data, as well as the necessary software to run system data, to copy, modify, add, delete, articulated run or create any derivative works, including but not limited to, the use of plug-in, plugins or not authorized by the Whoops of third-party tools/services access software and related systems./服务接入软件和相关系统。",
    "ua59": "     (5) By modifying or forging the instructions and data in the operation of the software, or by any means, adding, deleting or changing the functions or operation effects of the software, or operating the software and methods used for the above purposes or disseminating them to the public, no matter whether such ACTS are for commercial purposes or not.",
    "ua60": "     (6) Log in or use Whoops software and Services, or produce, publish or disseminate third-party software, plug-ins, plug-ins, systems, devices, etc. developed or authorized for login or use Whoops software and services by any means other than Whoops.",
    "ua61": "Xi. [Intellectual Property Rights Declaration]",
    "ua62": "     11.1 Intellectual property rights of content provided by Whoops in the Service (including but not limited to web pages, text, pictures, audio, video, charts, computer software, etc.) belong to Whoops, and intellectual property rights of content generated by users using the Service belong to users or relevant right holders, unless otherwise agreed by you and Whoops.",
    "ua63": "     11.2 Except as otherwise expressly stated, copyright, patent rights and other intellectual property rights of the software on which Whoops provides the Services are owned by Whoops.",
    "ua64": "     11.3 Whoops owns the copyright or trademark of the 'Whoops', 'Whoops' and Whoops images used by Whoops in the Service.",
    "ua65": "     11.4 The intellectual property rights of the above and any other content contained in the Service shall be protected by laws and regulations, and no person may use or create any derivative works in any form without the written permission of Whoops, User or the relevant right holder.",
    "ua66": "Xii. [User violation of Laws and Regulations]",
    "ua67": "     12.1 When using the Service, you shall abide by laws and regulations and shall not make, copy, publish or disseminate the information containing the following contents or engage in relevant activities, nor shall you facilitate the making, copying, publishing or disseminating the information containing the following contents:",
    "ua68": "     (1) opposing the fundamental principles established by the Constitution.",
    "ua69": "     (2) Endangering national security, divulging state secrets, subverting state power or undermining national unity.",
    "ua70": "     (3) damaging the honour and interests of the State.",
    "ua71": "     (4) Inciting ethnic hatred and discrimination and undermining ethnic unity.",
    "ua72": "     (5) Undermining the state's religious policies and promoting cults and feudal superstitions.",
    "ua73": "     (6) Spreading rumors, disturbing social order and undermining social stability.",
    "ua74": "     (7) disseminating obscenity, pornography, gambling, violence, murder, terror or abetting crimes.",
    "ua75": "     (8) insulting or slandering others, or infringing upon others' lawful rights and interests.",
    "ua76": "     (9) violate the 'seven bottom lines' of laws and regulations, socialist system, state interests, citizens' legitimate rights and interests, public order, morality and customs, and authenticity of information.",
    "ua77": "     (10) Prohibited by relevant laws and regulations or this Agreement, relevant agreement, rules, etc.",
    "ua78": "     12.2 If you violate the relevant laws and regulations or provisions of this Agreement while using the Service, the relevant national authorities or agencies may bring lawsuits, impose fines or take other sanctions against you and ask Whoops for assistance. You are solely responsible for any damage caused to you or others, and Whoops assumes no responsibility whatsoever.",
    "ua79": "     12.3 If you violate this Agreement, Whoops has the right to use its own judgment and take appropriate actions, including but not limited to removing, blocking or disconnecting by technical means. At the same time, Whoops reserves the right to take actions including but not limited to suspending or terminating the service provided to you, restricting, suspending, freezing or terminating your use of the Whoops account, and holding you liable, depending on the nature of user's actions.",
    "ua80": "     12.4 If you violate the provisions of this Agreement, resulting in any losses of the subject, you shall be solely liable. If Whoops loses money as a result, you should also pay for it.",
    "ua81": "Xiii. [Abide by local laws and regulations]",
    "ua82": "    13.1 In using the Service, you shall abide by relevant local laws and regulations and respect local morals and customs. If your action violates the local laws and regulations or moral customs, you should be responsible for it independently.",
    "ua83": "    13.2 You shall avoid using the Service which causes Whoops to violate laws and regulations or become involved in political and public events, otherwise Whoops reserves the right to suspend or terminate the service to you.",
    "ua84": "Xiv. [Content sent and disseminated by Users and Complaint Handling]",
    "ua85": "    14.1 You shall be solely responsible for the content (including but not limited to web pages, text, pictures, audio, video, charts, etc.) you send or disseminate through the Service.",
    "ua86": "    14.2 The content you send or broadcast shall be from a legal source owned by you or you have obtained the necessary authorization.",
    "ua87": "    14.3 Whoops reserves the right to delete, block or disconnect links at Whoops' sole discretion if the content you send or disseminate is illegal or violates the rights of others.",
    "ua88": "    14.4 If you are complained by others or you complain to others, Whoops shall have the right to provide the subject information, contact information, content related to the complaint and other necessary information of relevant parties in the dispute to the relevant parties or relevant departments, so as to solve the complaint and dispute timely and protect the legitimate rights and interests of all parties.",
    "ua89": "    14.5 You undertake to be responsible for the authenticity, legality and validity of the information, materials and evidence provided by you in the complaint handling procedure.",
    "ua90": "Xv. [Force Majeure and other Exemptions]",
    "ua91": "    15.1 You understand and agree that the Service may be affected by force majeure and other risk factors during the use of the Service. Force majeure refers to unforeseeable, insurmountable and unavoidable objective events that have a significant impact on one or both parties, including but not limited to natural disasters such as floods, earthquakes, epidemics and storms, as well as social events such as war, turmoil and government actions. In case of the above situation, Whoops will try its best to cooperate with relevant units in the first time and try to deal with it in a timely manner, but the loss caused to you by this Whoops shall be exempted from liability within the scope permitted by law.",
    "ua92": "    15.2 To the extent permitted by law, Whoops shall not be liable for service interruption or disruption caused by:",
    "ua93": "    (1) Be damaged by computer viruses, Trojan horses or other malicious programs or hacker attacks.",
    "ua94": "    (2) Failure of computer software, systems, hardware, and communication lines of user or Whoops.",
    "ua95": "    (3) Improper user operation or user's use of the Service in a manner not authorized by Whoops.",
    "ua96": "    (4) Program version obsolescence, equipment aging and/or compatibility issues./或其兼容性问题。",
    "ua97": "    (5) Other circumstances beyond the control of Whoops or reasonably foreseen.",
    "ua98": "    15.3 You understand and agree that during the use of the Service, you may encounter risks caused by network information or other user behaviors, and Whoops shall not be liable for the authenticity, applicability or legality of any information, nor for damages caused to you by infringement. These risks include, but are not limited to:",
    "ua99": "     (1) Information containing threatening, defamatory, offensive or illegal content from an anonymous or pseudonym of another person.",
    "ua100": "    (2) Any psychological, physical injury and economic loss caused or likely to be caused by the misrepresentation, deception or other causes of others.",
    "ua101": "    (3) Other risks caused by network information or user behavior.",
    "ua102": "   15.4Whoops is entitled to dispose of illegal content pursuant to this Agreement, and this right does not constitute an obligation or commitment of Whoops, and Whoops cannot guarantee that it will promptly detect any illegal activity or deal with it accordingly.",
    "ua103": "   15.5 Under no circumstances should you be so trusting as to borrow money, ask for passwords or other information concerning your property. Be sure to verify the identity of those involved in property operations, and always pay attention to Whoops for tips on fraud prevention.",
    "ua104": "Xvi. [Entry into Force and Modification of The Agreement]",
    "ua105": "    16.1 By using the Services, you shall be deemed to have read and be bound by this Agreement.",
    "ua106": "    16.2Whoops reserves the right to modify the terms of this Agreement as necessary. You can check the latest version of the terms of the Agreement on the relevant services page.",
    "ua107": "    16.3 If you continue to use the software or services provided by Whoops after the terms of this Agreement are changed, you will be deemed to have accepted the changed Agreement.",
    "ua108": "Xvii. [Change, Interruption and Termination of Service]",
    "ua109": "    17.1 You understand and agree that Whoops may change, interrupt, suspend or terminate the Service as a result of changes to its business policy.",
    "ua110": "    17.2 In the event of merger, division, acquisition or asset transfer by Whoops, Whoops may transfer the relevant assets under the Service to a third party; Whoops may also, upon unilateral notice to you, transfer some or all of the Services and the corresponding rights and obligations under this Agreement to a third party to operate or perform. The specific transferee subject is subject to Whoops notification.",
    "ua111": "    17.3 Whoops reserves the right to interrupt or terminate the service to you without notice if any of the following occurs:",
    "ua112": "    (1) You are required to submit real information according to laws and regulations, and the personal information you provide is not true, or inconsistent with the information at the time of registration and fails to provide reasonable proof.",
    "ua113": "    (2) You violate the provisions of relevant laws and regulations or the provisions of this Agreement.",
    "ua114": "    (3) As required by judicial authorities or competent authorities in accordance with laws and regulations.",
    "ua115": "    (4) For safety reasons or other necessary circumstances.",
    "ua116": "    17.4 Whoops reserves the right to charge as agreed in Article 8.2 of this Agreement. Whoops reserves the right to interrupt, suspend or terminate the service if you fail to pay the full amount on time.",
    "ua117": "    17.5 You are responsible for backing up the data stored in the Service. If your service is terminated, Whoops has the right to permanently delete your data from the server, except as otherwise provided by laws and regulations. Whoops is not obligated to provide or return data to you after the service is discontinued or terminated.",
    "ua118": "Xviii. [Jurisdiction and Application of Law]",
    "ua119": "    18.1 The establishment, entry into force, performance, interpretation, dispute settlement and other relevant matters of this Agreement shall be governed by the laws of the mainland of the People's Republic of China (excluding the law of conflicts).",
    "ua120": "    18.2 This Agreement is executed in Haidian District, Beijing, People's Republic of China.",
    "ua121": "    18.3 Any dispute or dispute between you and Whoops shall first be settled through friendly negotiation; If no agreement can be reached through negotiation, you agree to submit the dispute or dispute to the competent people's court of the place where this Agreement is signed (namely haidian District, Beijing, China) for jurisdiction.",
    "ua122": "    18.4 The headings of all the terms of this Agreement are for convenience only and have no practical meaning and cannot be used as the basis for interpretation of the meaning of this Agreement.",
    "ua123": "    18.5 No matter for what reason some of the provisions hereof are invalid or unenforceable, the remaining provisions shall remain valid and binding upon both parties.",
    "ua124": "    18.6 In case of any inconsistency between the Chinese and English versions of this Agreement, the Chinese version shall prevail.",
    "ua125": "Xix. [Terms of Use for Minors]",
    "ua126": "    19.1 If the User is under the age of 18, he/she is a minor and shall read the Agreement and use the Service under the guardianship and guidance of his/her guardian.",
    "ua127": "    19.2 Minor users are inexperienced in the world, easily confused by virtual network images, and have strong curiosity. They lack the ability to deal with emergencies according to their own circumstances. They are easy to be used by people with ulterior motives and lack the ability to protect themselves. Therefore, minor users should pay attention to the following matters when using the service to improve safety awareness and strengthen self-protection:",
    "ua128": "    (1) Recognize the difference between the online world and the real world, and avoid being addicted to the Internet, which will affect my daily study and life.",
    "ua129": "    (2) When filling in personal data, strengthen the awareness of personal protection, so as not to cause harassment to personal life by undesirable elements.",
    "ua130": "    (3) Learn to use the Network properly under the guidance of a guardian or teacher.",
    "ua131": "    (4) Avoid strangers to meet or participate in social activities at will, so as to avoid opportunities for lawbreakers to endanger their own safety.",
    "ua132": "    19.3 The guardian and the school should give more guidance for minors to use the service. In particular, parents should be concerned about their children's growth, pay attention to the communication with their children, guide their children to pay attention to the Internet safety problems, nip in the bud.",
    "ua133": "    19.4 If an adult who has reached the age of 18 does not have full capacity for civil conduct for any reason, the relevant provisions of the Terms of Use for minors applicable to this Agreement shall be referred to.",
    "ua134": "20. [Others]",
    "ua135": "    20.1 If you have any comments or Suggestions regarding this Agreement or the Services, please contact Whoops Customer Service and we will give you the necessary assistance. (End of text)",
    "ua136": "Whoops company",
    "privacyTitle": "Privacy Policy",
    "privacy1": "Whoops Privacy Protection Guidelines",
    "privacy2": "Whoops is a social service provided by us. To illustrate how Whoops collects, use and stores your personal information and what rights you have, we will explain to you through this guide. The main points are as follows:",
    "privacy3": "I. We will describe the types of personal information we collect about you and the purposes for which we collect it so that you can understand the types, reasons for use and methods of collection of specific personal information we collect about a particular function.",
    "privacy4": "Ii. When you use some features, we will obtain your consent, to collect some of your sensitive information, such as when you recommend you use the address book friend function we will collect the contact information of your mobile phone, unless in accordance with the relevant laws and regulations must be collected, refused to provide this information will only make you can't use related specific functions, but does not affect your normal use Whoops of other functions.",
    "privacy5": "Iii. Currently, Whoops will not take the initiative to share or transfer your personal information to third parties, such as there are other sharing or transfer your personal information or you need us to share your personal information or transfer to a third party, we will confirm directly the consent or third party with your express consent to the above action, in addition, we will provide information to foreign conduct risk assessment.",
    "privacy6": "Iv. At present, for business development in Whoops indirectly from a third party access to your personal information, we will express to you before getting your personal information source, type and scope of use, such as Whoops do business need to personal information processing activities beyond when you provide personal information to a third party agreed scope of authorization, we will deal with you in the personal information, such as your express consent; In addition, we will strictly abide by relevant laws and regulations, and require third parties to guarantee the legality of the information they provide.",
    "privacy7": "V. You may access, correct and delete your personal information through the channels listed in this Guideline, or you may withdraw your consent, cancel your account, lodge complaints and set up privacy functions.",
    "privacy8": "Vi. In order to collect your information or provide you with services, optimize our services and protect the security of your account under this Guidance, we will need to request permission from you; Sensitive permissions such as address book, precise geolocation, camera, microphone, photo album, etc. will not be enabled by default and will only be granted to us with your express consent.",
    "privacy9": "In particular, access to sensitive permissions is a necessary, not a sufficient, condition for us to collect specific information. Just because we have specific sensitive rights doesn't mean we will necessarily collect information about you; Even if we have obtained sensitive permissions, we will only collect information about you in accordance with this guide when necessary.",
    "privacy10": "If you want more detailed information, please read the corresponding chapters according to the following index:",
    "privacy11": "1. The information we collect",
    "privacy12": "2. Information storage",
    "privacy13": "3. Information security",
    "privacy14": "4. How do we use information",
    "privacy15": "5. Offer",
    "privacy16": "6. Your Rights",
    "privacy17": "7. Change in",
    "privacy18": "8. Protection of minors",
    "privacy19": "9. Other",
    "privacy20": "10. Contact us",
    "privacy21": "1. The information we collect",
    "privacy22": "During your use of Whoops Service, Whoops will collect the information you provide or generate as a result of using the Service in order to provide you with the service, optimize our service and protect your account security as follows:",
    "privacy23": "1.1 When you sign up for Whoops service, we collect your nickname, avatar, and mobile phone number. This information is collected to help you complete Whoops registration and protect your Whoops account. Mobile phone Numbers are sensitive information, and such information is collected to meet the requirements of online real-name registration required by relevant laws and regulations. If you do not provide this information, you may not be able to use our services properly. You can also choose to fill in information such as gender and region according to your needs. In addition, you may choose to provide us with your voiceprint eigenvalue information, which is sensitive information. Refusing to provide this information will only prevent you from using the voiceprint lock function, but will not affect your normal use of other functions of Whoops.",
    "privacy24": "1.2 when you use the Whoops service, to ensure your normal using our service, maintain the normal operation of our service, improve and optimize our service experience, and ensure the security of your account, we will collect your device model, operating system, the only device identifier (referred to by the equipment manufacturer into the equipment in a string of characters, Can be used for the corresponding equipment), to identify unique way on IP address, Whoops software version number, access networks, data type and status, network quality, equipment accelerator (such as gravity sensing devices), operation logs and service log information (such as your search, check the operation record in Whoops, service information such as fault information, referral url) such as logging information, this information is to provide information service must collect basis.",
    "privacy25": "1.3 When you use Whoops to create a group face to face, we will record your location information after obtaining your voluntary consent, for the purpose of providing the service to you. This information is sensitive information. Refusing to provide this information will only prevent you from using the above functions, but will not affect your normal use of the other functions of Whoops. In addition, you can turn off the feature at any time and erase your geo-location information within the feature.",
    "privacy26": "1.4 When you use the address book feature, we will irreversibly encrypt your address book information and only collect the encrypted information. The above information is sensitive information. Refusing to provide this information will only make you unable to use the above functions, but will not affect your normal use of other functions of Whoops.",
    "privacy27": "1.5 When you use Whoops search, we will collect your search record, reading record, recommendation record and visit time, interaction record, in order to provide you with more accurate and personalized service and content.",
    "privacy28": "1.6 When you use Whoops voice input, voice to text conversion, and Whoops Translation functions, we will collect your voice content, the voice or text information to be converted, and the text information to be translated, as the collection is necessary to achieve the above functions. After we process it in real time, we return the results to you, we don't save your data.",
    "privacy29": "1.7 When you use Whoops to communicate with other software or hardware, the provider of other software or hardware may, with your consent, obtain information that you actively disclose or transmit in Whoops. You should fully understand the product functions and information protection policies of other software or hardware before choosing.",
    "privacy30": "1.8 When you use the Whoops Video Dynamic feature, the video information you upload will be stored on our server, as storage is required to implement this feature. We store it in encrypted form, and you can delete any video you upload at any time. We will not provide such information to the public or use it for any purpose other than this function unless you choose to do so or comply with the requirements of relevant laws and regulations.",
    "privacy31": "1.9 When you use Whoops favorites to store all kinds of information, the information will be uploaded and stored on our server, so that you can use the information when you log in Whoops on other devices, which is necessary to implement the favorites function. We will store your information in encrypted form, and you can delete your information at any time. We will not provide such information to the public or use it for any purpose other than this function unless you choose to do so or comply with the requirements of relevant laws and regulations.",
    "privacy32": "1.10 You may enter gender, region, signature, address, invoice title, etc. in your personal information field, which will be uploaded and stored on our servers for you to use when you log in Whoops on other devices. You can also modify, delete such information at any time.",
    "privacy33": "1.11 When you use Whoops group chat, the group name, group announcement, group member nickname, group Settings, and other information will be stored in our server, because storage is necessary to implement this function.",
    "privacy34": "1.12 We will not collect your chat records. Your chat in Whoops will be stored on your terminal, and you can choose to back it up, delete it, or move it from device to device.",
    "privacy35": "1.13 Third party services in Whoops service are provided by external third party principals, and Whoops cannot access the information generated when you use such third party services. However, if you expressly consent to this third party obtaining your geolocation information, that third party will obtain your terminal geolocation information through the Whoops interface. This information is sensitive information. Refusal to provide this information will only prevent you from using the above third party services, but will not affect your normal use of Whoops functions.",
    "privacy36": "In addition, in accordance with applicable laws, regulations and national standards, we may collect and use your relevant personal information without requiring your authorized consent in the following circumstances:",
    "privacy37": "A) related to the performance of the obligations stipulated by laws and regulations by the personal information controller;",
    "privacy38": "B) those directly related to national security and national defense security;",
    "privacy39": "C) those directly related to public safety, public health and major public interests;",
    "privacy40": "D) those directly related to criminal investigation, prosecution, trial and execution of judgment;",
    "privacy41": "E) For the purpose of safeguarding the major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, but it is difficult to obtain authorization and consent of the person;",
    "privacy42": "F) The personal information involved is disclosed to the public by the subject of personal information;",
    "privacy43": "G) necessary to sign and perform the contract according to the requirements of the subject of personal information;",
    "privacy44": "H) Collecting personal information from legally disclosed information, such as legitimate news reports, government information disclosure and other channels;",
    "privacy45": "I) Necessary to maintain the safe and stable operation of the product or service provided, such as the discovery and disposal of faults of the product or service;",
    "privacy46": "J) The person controlling personal information is a news agency, and it is necessary for it to carry out legitimate news reports;",
    "privacy47": "K) The personal information controller is an academic research institution. When it is necessary to carry out statistics or academic research in the public interest and it provides the results of academic research or description to the outside world, the personal information contained in the results is de-labeled.",
    "privacy48": "Please understand that the prices we offer you the functions and services are constantly updated and development, if a certain function or service is not in the foregoing statement and collected your information, we will have a page prompts, interactive process, such as web site announcement to tell you the content of the information collection, the scope and purpose, with your approval.",
    "privacy49": "Please note that Whoops currently does not actively retrieve your personal information from a third party outside Whoops. As for business development in the future from a third party of indirect access to your personal information, we will express to you before getting your personal information source, type and scope of use, such as Whoops operations require personal information processing activities beyond when you provide personal information to a third party agreed scope of authorization, we will deal with you in the personal information, such as your express consent; In addition, we will strictly abide by relevant laws and regulations, and require third parties to guarantee the legality of the information they provide.",
    "privacy50": "2. Information storage",
    "privacy51": "2.1 Location of information storage",
    "privacy52": "We will store the personal information collected within China in accordance with laws and regulations. If your personal information is transferred from China to another country, we will strictly comply with the law.",
    "privacy53": "2.2 Term of information storage",
    "privacy54": "In general, we retain your personal information only for the period of time necessary to achieve our purposes, such as:",
    "privacy55": "Mobile phone number: If you need to use Whoops service, we need to always save your mobile phone number, to ensure that you can use the service normally, when you cancel Whoops account, we will delete the corresponding information;",
    "privacy56": "Happen to stop operating when our products or services, we will inform you in the form of push notifications, announcements, etc, and within a reasonable period of time to delete your personal information or deal with an anonymous (so-called 'anonymous', refers to the technical processing of personal information, makes the personal information subject cannot be identified, and after processing the information cannot be recovery process. Personal information obtained after anonymous processing does not belong to personal information. .",
    "privacy57": "3. Information security",
    "privacy58": "We strive to ensure the security of our users' information to prevent information loss, improper use, unauthorized access or disclosure.",
    "privacy59": "We will use a variety of security measures to ensure the security of information within a reasonable level of security. For example, we use encryption (e.g., SSL), anonymous processing, etc., to protect your personal information.",
    "privacy60": "We are constantly enhancing the security capabilities of the software installed on your device through improved technology to prevent the disclosure of your personal information. For example, we will encrypt some information locally on your device for secure transmission. In order to prevent viruses, Trojans or other malicious programs or websites, we may learn about the application information installed on your device, the running process information or the data stored in the device's memory; In order to prevent fraud, number theft, impersonation and other illegal activities and conduct security checks, data such as unique device identifier, login IP address, operation log and geographic location information may be analyzed to facilitate the adoption of security measures or security reminders to users.",
    "privacy61": "We establish special management system, process and organization to ensure the security of information. For example, we strictly limit the number of people who can access information, require them to observe confidentiality obligations, and conduct audits.",
    "privacy62": "In case of security incidents such as personal information leakage, we will activate emergency plans to prevent the expansion of security incidents, and inform you in the form of push notifications, announcements, etc.",
    "privacy63": "We will do our best to protect your personal information. We also ask you to understand that no security measure can be perfect.",
    "privacy64": "4. How do we use information",
    "privacy65": "We may use the information collected through certain functions for our other services. We could, for example, when you use a function or service of the information we collect, in another function or service to provide specific content to you or your friends, including but not limited to display ads (you can know more in about AD pages), have you read the content of information security of class, based on the characteristics of the labels suggest indirectly portraits and provides more precise and personalized services and content, etc.",
    "privacy66": "To secure our services and help us better understand how our application is performing, we may record relevant information, such as how often you use the application, crash data, overall usage, performance data, and where the application came from. We will not combine the information we store in our analytics software with any personally identifiable information you provide in your application.",
    "privacy67": "If we use your personal Information in a way that is not directly or reasonably relevant to the purpose for which it was collected, we will notify you again and obtain your express consent before using your personal Information.",
    "privacy68": "5. Offer",
    "privacy69": "At this time, we do not actively share or transfer your personal information to third parties outside Whoops. In the event of any other sharing or transfer of your personal information to third parties outside Whoops where you require us to share or transfer your personal information to third parties outside Whoops, we will directly or confirm that third parties have obtained your express consent to do so.",
    "privacy70": "We will not publicly disclose the personal information we collect. If necessary, we will inform you of the purpose of this public disclosure, the type of information disclosed and the sensitive information that may be involved, and we will obtain your express consent.",
    "privacy71": "When you log in to an application run by a third-party entity via Whoops personal account, we will provide your personal information to such third-party entity. The specific scope of external provision is subject to your confirmation in the interactive page. In addition, we will not provide your personal information to such third parties without your express consent.",
    "privacy72": "As our business continues to grow, we may enter into mergers, acquisitions, asset transfers and other transactions, and we will inform you of the circumstances, the continued protection of your personal information in accordance with laws and regulations and standards not lower than those required by this Guidance or the requirement that new controllers continue to protect your personal information.",
    "privacy73": "In addition, in accordance with relevant laws, regulations and national standards, we may share, transfer or publicly disclose personal information in the following situations without prior authorization and consent of the subject of personal information:",
    "privacy74": "A) related to the performance of our obligations under laws and regulations;",
    "privacy75": "B) those directly related to national security and national defense security;",
    "privacy76": "C) those directly related to public safety, public health and major public interests;",
    "privacy77": "D) those directly related to criminal investigation, prosecution, trial and execution of judgment;",
    "privacy78": "E) For the purpose of safeguarding the major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, but it is difficult to obtain authorization and consent of the person;",
    "privacy79": "F) Personal information disclosed by the subject to the public;",
    "privacy80": "G) Collecting personal information from legally disclosed information, such as legitimate news reports, government information disclosure and other channels.",
    "privacy81": "6. Your Rights",
    "privacy82": "To make it easier for you to access, correct and delete your personal information while using Whoops, and to protect your right to withdraw your consent and cancel your account, we provide you with the appropriate operation Settings in the product design. You can refer to the following guidelines to do so. In addition, we have set up a complaint reporting channel, your opinions will be dealt with in a timely manner. ",
    "privacy83": "6.1 Access to Personal Information",
    "privacy84": "6.1.1 Access profile picture, nickname, Whoops number, QR code, gender, region, signature, address and other basic information:",
    "privacy85": "1) After entering Whoops, click 'I';",
    "privacy86": "2) Click the avatar bar;",
    "privacy87": "3) Conduct information query and access.",
    "privacy88": "6.1.2 Access Whoops number, phone number, Whoops password, voice lock, emergency contact, more security Settings:",
    "privacy89": "1) After entering Whoops, click 'I';",
    "privacy90": "2) Click 'Settings';",
    "privacy91": "3) Click 'Account and Security';",
    "privacy92": "4) Access Whoops number, phone number, Whoops password, voice lock, emergency contact, and more security Settings;",
    "privacy93": "6.1.3 Access the address book blacklist",
    "privacy94": "1) After entering Whoops, click 'I';",
    "privacy95": "2) Click 'Settings';",
    "privacy96": "3) Click 'Privacy';",
    "privacy97": "4) Click 'Address book Blacklist' to query.",
    "privacy98": "6.2 Delete personal information",
    "privacy99": "6.2.1 Delete all one-to-one chat records:",
    "privacy100": "1) After entering Whoops, open the dialog and click the icon in the upper right corner;",
    "privacy101": "2) Click clear chat record.",
    "privacy102": "6.2.2 Delete group chat records:",
    "privacy103": "1) After entering Whoops, open the dialog and click the icon in the upper right corner;",
    "privacy104": "2) Click clear chat record.",
    "privacy105": "6.2.3 Delete some chat records:",
    "privacy106": "1) After entering Whoops, open the dialog, and long press to click a message to be deleted;",
    "privacy107": "2) Select 'Delete' to delete this message;",
    "privacy108": "6.2.4 Delete avatar, nickname, gender, region, shipping address and other basic information (Whoops number and QR code cannot be modified) :",
    "privacy109": "1) After entering Whoops, click 'I';",
    "privacy110": "2) Click the avatar bar;",
    "privacy111": "3) Delete information. ",
    "privacy112": "6.3 Correction of personal information",
    "privacy113": "6.3.1 Change of Avatar, nickname, gender, region, personality signature, my address:",
    "privacy114": "1) After entering Whoops, click 'I';",
    "privacy115": "2) Click the avatar bar;",
    "privacy116": "3) Change avatar, nickname, gender, region, personality signature, my address.",
    "privacy117": "6.3.2 Change mobile phone number, Whoops password, voice lock, emergency contact:",
    "privacy118": "1) After entering Whoops, click 'I';",
    "privacy119": "2) Click 'Settings';",
    "privacy120": "3) Click 'Account and Security';",
    "privacy121": "4) Change phone number, Whoops password, voice lock, emergency contact.",
    "privacy122": "6.4 Close the recommended address book friends",
    "privacy123": "1) After entering Whoops, click 'I';",
    "privacy124": "2) Click 'Settings';",
    "privacy125": "3) Click 'Privacy';",
    "privacy126": "4) You can close 'Recommend Address Book friends to me'.",
    "privacy127": "6.5 Cancel Whoops account",
    "privacy128": "1) After entering Whoops, click 'I';",
    "privacy129": "2) Click 'Settings';",
    "privacy130": "3) Click 'Account and Security';",
    "privacy131": "4) Click 'Whoops Safety Center';",
    "privacy132": "5) Click 'Cancel account'.",
    "privacy133": "Note: After you cancel your account, we will retain your relevant information in accordance with laws and regulations such as the Network Security Law of the People's Republic of China; After the expiration of the legal retention period, we will delete or anonymize your personal information.",
    "privacy134": "6.6 Complaints and reports",
    "privacy135": "1) After entering Whoops, click 'I';",
    "privacy136": "2) Click 'Settings';",
    "privacy137": "3) Click 'About Whoops';",
    "privacy138": "4) Click 'Complaint'.",
    "privacy139": "6.7 Privacy Settings",
    "privacy140": "6.7.1 Set whether verification is required when adding friends:",
    "privacy141": "1) After entering Whoops, click 'I';",
    "privacy142": "2) Click 'Settings';",
    "privacy143": "3) Click 'Privacy';",
    "privacy144": "4) Click 'Verify when Adding me as a friend' to make the change.",
    "privacy145": "6.7.2 Set the way in which users can be added:",
    "privacy146": "1) After entering Whoops, click 'I';",
    "privacy147": "2) Click 'Settings';",
    "privacy148": "3) Click 'Privacy';",
    "privacy149": "4) Click 'Add my way' to make the change.",
    "privacy150": "6.7.3 Choose to use different personal information to log into websites or applications other than Whoops:",
    "privacy151": "1) Click 'Whoops Login' or any other icon (usually Whoops icon) that refers to the site or application that allows you to log in using your Whoops personal account;",
    "privacy152": "2) Select different personal information (avatar, nickname) or create new user information (avatar, nickname) to use as the avatar and nickname to log into the website or application. However, please note that you cannot select or create different regional or gender information when you log into such websites or applications.",
    "privacy153": "7.Change ",
    "privacy154": "We may amend the Guidelines in due course. When the terms of the Guidelines are changed, we will show you the changed guidelines in push notifications, pop-ups or other appropriate forms when you log in and update the version.",
    "privacy155": "8. Protection of minors",
    "privacy156": "We attach great importance to the protection of minors' personal information. According to relevant laws and regulations, if you are under the age of 18, you should obtain the prior written consent of your parent or legal guardian before using Whoops. If you are the guardian of a minor, if you have any questions regarding the personal information of a minor under your guardianship, please contact us through the contact information in section 10.",
    "privacy157": "In particular, it is not recommended if you are a child under the age of 18.",
    "privacy158": "9. Other",
    "privacy159": "Whoops Privacy Policy is a general privacy policy that applies uniformly to Whoops, and the user rights and information security safeguards specified therein apply to Whoops users. If Whoops privacy Policy is inconsistent or inconsistent with this Guidance, please follow this guidance. ",
    "privacy160": "10. Contact us",
    "privacy161": "If you have any other complaints, Suggestions, or questions related to the personal information of minors, you may send your questions to weizhen20140325@163.com",
    "privacy162": "We will review the issue as soon as possible and reply within 15 days after verifying your user identity."
}